f9micro/f9-kernel/include/platform/stm32f10/registers.h
#define RCC_PLLCFGR_RESET               (uint32_t) (0x24003010)                                 /* PLLCFGR register reset value */
#define RCC_PLLCFGR_PLLSRC_HSE          (uint32_t) (1 << 22)                                    /* HSE oscillator selected as clock entry */

#define RCC_CFGR_SW_M                   (uint32_t) (3 << 0)                                     /* System clock switch mask */
#define RCC_CFGR_SW_HSI                 (uint32_t) (0 << 0)                                     /* System clock switch - HSI selected as system clock */
#define RCC_CFGR_SW_HSE                 (uint32_t) (1 << 0)                                     /* System clock switch - HSE selected as system clock */
#define RCC_CFGR_SW_PLL                 (uint32_t) (2 << 0)                                     /* System clock switch - PLL selected as system clock */
#define RCC_CFGR_SWS_M                  (uint32_t) (3 << 2)                                     /* System clock switch status mask */
#define RCC_CFGR_SWS_HSI                (uint32_t) (0 << 2)                                     /* System clock switch status - HSI used as system clock */
#define RCC_CFGR_SWS_HSE                (uint32_t) (1 << 2)                                     /* System clock switch status - HSE used as system clock */
#define RCC_CFGR_SWS_PLL                (uint32_t) (2 << 2)                                     /* System clock switch status - PLL used as system clock */
#define RCC_CFGR_HPRE_M                 (uint32_t) (0xF << 4)                                   /* AHB prescaler mask */
#define RCC_CFGR_HPRE_DIV1              (uint32_t) (0x0 << 4)                                   /* AHB prescaler - SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2              (uint32_t) (0x8 << 4)                                   /* AHB prescaler - SYSCLK/2 */
#define RCC_CFGR_HPRE_DIV4              (uint32_t) (0x9 << 4)                                   /* AHB prescaler - SYSCLK/4 */
#define RCC_CFGR_HPRE_DIV8              (uint32_t) (0xA << 4)                                   /* AHB prescaler - SYSCLK/8 */
#define RCC_CFGR_HPRE_DIV16             (uint32_t) (0xB << 4)                                   /* AHB prescaler - SYSCLK/16 */
#define RCC_CFGR_HPRE_DIV64             (uint32_t) (0xC << 4)                                   /* AHB prescaler - SYSCLK/64 */
#define RCC_CFGR_HPRE_DIV128            (uint32_t) (0xD << 4)                                   /* AHB prescaler - SYSCLK/128 */
#define RCC_CFGR_HPRE_DIV256            (uint32_t) (0xE << 4)                                   /* AHB prescaler - SYSCLK/256 */
#define RCC_CFGR_HPRE_DIV512            (uint32_t) (0xF << 4)                                   /* AHB prescaler - SYSCLK/512 */
#define RCC_CFGR_PPRE1_M                (uint32_t) (7 << 8)                                    /* APB low speed prescaler mask */
#define RCC_CFGR_PPRE1_DIV1             (uint32_t) (0 << 8)                                    /* APB low speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE1_DIV2             (uint32_t) (4 << 8)                                    /* APB low speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE1_DIV4             (uint32_t) (5 << 8)                                    /* APB low speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE1_DIV8             (uint32_t) (6 << 8)                                    /* APB low speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE1_DIV16            (uint32_t) (7 << 8)                                    /* APB low speed prescaler - HCLK/16 */
#define RCC_CFGR_PPRE2_M                (uint32_t) (7 << 11)                                    /* APB high speec prescaler mask */
#define RCC_CFGR_PPRE2_DIV1             (uint32_t) (0 << 11)                                    /* APB high speed prescaler - HCLK/1 */
#define RCC_CFGR_PPRE2_DIV2             (uint32_t) (4 << 11)                                    /* APB high speed prescaler - HCLK/2 */
#define RCC_CFGR_PPRE2_DIV4             (uint32_t) (5 << 11)                                    /* APB high speed prescaler - HCLK/4 */
#define RCC_CFGR_PPRE2_DIV8             (uint32_t) (6 << 11)                                    /* APB high speed prescaler - HCLK/8 */
#define RCC_CFGR_PPRE2_DIV16            (uint32_t) (7 << 11)                                    /* APB high speed prescaler - HCLK/16 */
#define RCC_CFGR_RTCPRE_M               (uint32_t) (0x1F << 16)                                 /* HSE division factor for RTC clock mask */
#define RCC_CFGR_RTCPRE(n)              (uint32_t) (n << 16)                                    /* HSE division factor for RTC clock */

#define RCC_AHB1RSTR_GPIOARST           (uint32_t) (1 << 0)                                     /* GPIOA reset */
#define RCC_AHB1RSTR_GPIOBRST           (uint32_t) (1 << 1)                                     /* GPIOB reset */
#define RCC_AHB1RSTR_GPIOCRST           (uint32_t) (1 << 2)                                     /* GPIOC reset */
#define RCC_AHB1RSTR_GPIODRST           (uint32_t) (1 << 3)                                     /* GPIOD reset */
#define RCC_AHB1RSTR_GPIOERST           (uint32_t) (1 << 4)                                     /* GPIOE reset */
#define RCC_AHB1RSTR_GPIOFRST           (uint32_t) (1 << 5)                                     /* GPIOF reset */
#define RCC_AHB1RSTR_GPIOGRST           (uint32_t) (1 << 6)                                     /* GPIOG reset */
#define RCC_AHB1RSTR_GPIOHRST           (uint32_t) (1 << 7)                                     /* GPIOH reset */
#define RCC_AHB1RSTR_GPIOIRST           (uint32_t) (1 << 8)                                     /* GPIOI reset */
#define RCC_AHB1RSTR_CRCRST             (uint32_t) (1 << 12)                                    /* CRC reset */
#define RCC_AHB1RSTR_DMA1RST            (uint32_t) (1 << 21)                                    /* DMA1 reset */
#define RCC_AHB1RSTR_DMA2RST            (uint32_t) (1 << 22)                                    /* DMA2 reset */
#define RCC_AHB1RSTR_ETHMACRST          (uint32_t) (1 << 25)                                    /* Ethernet MAC reset */
#define RCC_AHB1RSTR_OTGHSRST           (uint32_t) (1 << 29)                                    /* USB OTG HS reset */

