f9micro/f9-kernel/include/platform/stm32f10/registers.h
#define TIMx_CR2_CCDS                   (uint32_t) (1 << 3)                                     /* TIMx capture/compare DMA requests send when update event occurs */
#define TIMx_CR2_MMS_RST                (uint32_t) (0 << 4)                                     /* TIMx master mode - reset */
#define TIMx_CR2_MMS_EN                 (uint32_t) (1 << 4)                                     /* TIMx master mode - enable */
#define TIMx_CR2_MMS_UP                 (uint32_t) (2 << 4)                                     /* TIMx master mode - update */
#define TIMx_CR2_MMS_CMP_PUL            (uint32_t) (3 << 4)                                     /* TIMx master mode - compare pulse */
#define TIMx_CR2_MMS_CMP_OC1            (uint32_t) (4 << 4)                                     /* TIMx master mode - compare OC1 */
#define TIMx_CR2_MMS_CMP_OC2            (uint32_t) (5 << 4)                                     /* TIMx master mode - compare OC2 */
#define TIMx_CR2_MMS_CMP_OC3            (uint32_t) (6 << 4)                                     /* TIMx master mode - compare OC3 */
#define TIMx_CR2_MMS_CMP_OC4            (uint32_t) (7 << 4)                                     /* TIMx master mode - compare OC4 */
#define TIMx_CR2_TI1_123                (uint32_t) (1 << 7)                                     /* TIMx CH1, CH2, CH3 pins connected to TI1 */

#define TIMx_DIER_UIE                   (uint32_t) (1 << 0)                                     /* TIMx update interrupt enable */
#define TIMx_DIER_CC1IE                 (uint32_t) (1 << 1)                                     /* TIMx CC1 interrupt enable */
#define TIMx_DIER_CC2IE                 (uint32_t) (1 << 2)                                     /* TIMx CC2 interrupt enable */
#define TIMx_DIER_CC3IE                 (uint32_t) (1 << 3)                                     /* TIMx CC3 interrupt enable */
#define TIMx_DIER_CC4IE                 (uint32_t) (1 << 4)                                     /* TIMx CC4 interrupt enable */
#define TIMx_DIER_TIE                   (uint32_t) (1 << 6)                                     /* TIMx trigger interrupt enable */
#define TIMx_DIER_UDE                   (uint32_t) (1 << 8)                                     /* TIMx update DMA request enable */
#define TIMx_DIER_CC1DE                 (uint32_t) (1 << 9)                                     /* TIMx CC1 DMA request enable */
#define TIMx_DIER_CC2DE                 (uint32_t) (1 << 10)                                    /* TIMx CC2 DMA request enable */
#define TIMx_DIER_CC3DE                 (uint32_t) (1 << 11)                                    /* TIMx CC3 DMA request enable */
#define TIMx_DIER_CC4DE                 (uint32_t) (1 << 12)                                    /* TIMx CC4 DMA request enable */
#define TIMx_DIER_TDE                   (uint32_t) (1 << 14)                                    /* TIMx trigger DMA request enable */

/* SPI */
#define SPI_CR1_CPHA                    (uint32_t) (1 << 0)                                     /* SPI clock phase */
#define SPI_CR1_CPOL                    (uint32_t) (1 << 1)                                     /* SPI clock polarity */
#define SPI_CR1_MSTR                    (uint32_t) (1 << 2)                                     /* SPI master selection */
#define SPI_CR1_BR_2                    (uint32_t) (0 << 3)                                     /* SPI baud rate = fPCLK/2 */
#define SPI_CR1_BR_4                    (uint32_t) (1 << 3)                                     /* SPI baud rate = fPCLK/4 */
#define SPI_CR1_BR_8                    (uint32_t) (2 << 3)                                     /* SPI baud rate = fPCLK/8 */
#define SPI_CR1_BR_16                   (uint32_t) (3 << 3)                                     /* SPI baud rate = fPCLK/16 */
#define SPI_CR1_BR_32                   (uint32_t) (4 << 3)                                     /* SPI baud rate = fPCLK/32 */
#define SPI_CR1_BR_64                   (uint32_t) (5 << 3)                                     /* SPI baud rate = fPCLK/64 */
#define SPI_CR1_BR_128                  (uint32_t) (6 << 3)                                     /* SPI baud rate = fPCLK/128 */
#define SPI_CR1_BR_256                  (uint32_t) (7 << 3)                                     /* SPI baud rate = fPCLK/256 */
#define SPI_CR1_SPE                     (uint32_t) (1 << 6)                                     /* SPI enable */
#define SPI_CR1_LSBFIRST                (uint32_t) (1 << 7)                                     /* SPI LSB transmitted first */
#define SPI_CR1_SSI                     (uint32_t) (1 << 8)                                     /* SPI internal slave select */
#define SPI_CR1_SSM                     (uint32_t) (1 << 9)                                     /* SPI software slave management */
#define SPI_CR1_DFF                     (uint32_t) (1 << 11)                                    /* SPI data frame format (0 = 8bit, 1 = 16bit) */
#define SPI_SR_RXNE                     (uint32_t) (1 << 0)                                     /* SPI receive not empty */
#define SPI_SR_TXNE                     (uint32_t) (1 << 1)                                     /* SPI transmit not empty */
#define SPI_SR_CHSIDE                   (uint32_t) (1 << 2)                                     /* SPI channel side */
#define SPI_SR_UDR                      (uint32_t) (1 << 3)                                     /* SPI underrun flag */
#define SPI_SR_CRCERR                   (uint32_t) (1 << 4)                                     /* SPI CRC error flag */
#define SPI_SR_MODF                     (uint32_t) (1 << 5)                                     /* SPI mode fault */
#define SPI_SR_OVR                      (uint32_t) (1 << 6)                                     /* SPI overrun flag */
#define SPI_SR_BSY                      (uint32_t) (1 << 7)                                     /* SPI busy flag */
#define SPI_SR_TIRFE                    (uint32_t) (1 << 8)                                     /* SPI TI frame format error */

/* I2C */
#define I2C_CR1_PE                      (uint32_t) (1 << 0)                                     /* I2C peripheral enable */
#define I2C_CR1_SMBUS                   (uint32_t) (1 << 1)                                     /* I2C SMBus mode */
#define I2C_CR1_SMBTYPE                 (uint32_t) (1 << 3)                                     /* I2C SMBus type (0=Device, 1=Host) */
#define I2C_CR1_ENARP                   (uint32_t) (1 << 4)                                     /* I2C enable ARP */
#define I2C_CR1_ENPEC                   (uint32_t) (1 << 5)                                     /* I2C enable PEC */
#define I2C_CR1_ENGC                    (uint32_t) (1 << 6)                                     /* I2C enable general call */
#define I2C_CR1_NOSTRETCH               (uint32_t) (1 << 7)                                     /* I2C clock stretching disable */
#define I2C_CR1_START                   (uint32_t) (1 << 8)                                     /* I2C START generation */
#define I2C_CR1_STOP                    (uint32_t) (1 << 9)                                     /* I2C STOP generation */
#define I2C_CR1_ACK                     (uint32_t) (1 << 10)                                    /* I2C ACK enable */
#define I2C_CR1_POS                     (uint32_t) (1 << 11)                                    /* I2C ACK/PEC position */
#define I2C_CR1_PEC                     (uint32_t) (1 << 12)                                    /* I2C packet error checking */
#define I2C_CR1_ALERT                   (uint32_t) (1 << 13)                                    /* I2C SMBus alert */
#define I2C_CR1_SWRST                   (uint32_t) (1 << 15)                                    /* I2C software reset */

#define I2C_CR2_FREQ(n)                 (uint32_t) (n << 0)                                     /* I2C clock frequency */
#define I2C_CR2_ITERREN                 (uint32_t) (1 << 8)                                     /* I2C error interrupt enable */
#define I2C_CR2_ITEVTEN                 (uint32_t) (1 << 9)                                     /* I2C event interrupt enable */
#define I2C_CR2_ITBUFEN                 (uint32_t) (1 << 10)                                    /* I2C buffer interrupt enable */
#define I2C_CR2_DMAEN                   (uint32_t) (1 << 11)                                    /* I2C DMA requests enable */
#define I2C_CR2_LAST                    (uint32_t) (1 << 12)                                    /* I2C DMA last transfer */

#define I2C_OAR1_ADD10(n)               (uint32_t) (n << 0)                                     /* I2C interface address (10-bit) */
#define I2C_OAR1_ADD7(n)                (uint32_t) (n << 1)                                     /* I2C interface address (7-bit) */
#define I2C_OAR1_ADDMODE                (uint32_t) (1 << 15)                                    /* I2C interface address mode (1=10-bit) */

#define I2C_OAR2_ENDUAL                 (uint32_t) (1 << 0)                                     /* I2C dual address mode enable */
#define I2C_OAR2_ADD2(n)                (uint32_t) (n << 1)                                     /* I2C interface address 2 (7-bit) */

#define I2C_SR1_SB                      (uint32_t) (1 << 0)                                     /* I2C start bit generated */
#define I2C_SR1_ADDR                    (uint32_t) (1 << 1)                                     /* I2C address sent/matched */
#define I2C_SR1_BTF                     (uint32_t) (1 << 2)                                     /* I2C byte transfer finished */
#define I2C_SR1_ADD10                   (uint32_t) (1 << 3)                                     /* I2C 10-bit header sent */
#define I2C_SR1_STOPF                   (uint32_t) (1 << 4)                                     /* I2C stop detection */
#define I2C_SR1_RXNE                    (uint32_t) (1 << 6)                                     /* I2C DR not empty */
#define I2C_SR1_TXE                     (uint32_t) (1 << 7)                                     /* I2C DR empty */
#define I2C_SR1_BERR                    (uint32_t) (1 << 8)                                     /* I2C bus error */
#define I2C_SR1_ARLO                    (uint32_t) (1 << 9)                                     /* I2C attribution lost */
#define I2C_SR1_AF                      (uint32_t) (1 << 10)                                    /* I2C acknowledge failure */
#define I2C_SR1_OVR                     (uint32_t) (1 << 11)                                    /* I2C overrun/underrun */
#define I2C_SR1_PECERR                  (uint32_t) (1 << 12)                                    /* I2C PEC error in reception */
#define I2C_SR1_TIMEOUT                 (uint32_t) (1 << 14)                                    /* I2C timeout or tlow error */
#define I2C_SR1_SMBALERT                (uint32_t) (1 << 15)                                    /* I2C SMBus alert */

#define I2C_SR2_MSL                     (uint32_t) (1 << 0)                                     /* I2C master/slave */
#define I2C_SR2_BUSY                    (uint32_t) (1 << 1)                                     /* I2C bus busy */
#define I2C_SR2_TRA                     (uint32_t) (1 << 2)                                     /* I2C transmitter/receiver */
#define I2C_SR2_GENCALL                 (uint32_t) (1 << 4)                                     /* I2C general call address */
#define I2C_SR2_SMBDEFAULT              (uint32_t) (1 << 5)                                     /* I2C SMBus device default address */
#define I2C_SR2_SMBHOST                 (uint32_t) (1 << 6)                                     /* I2C SMBus host header */
#define I2C_SR2_DUALF                   (uint32_t) (1 << 7)                                     /* I2C dual flag */
#define I2C_SR2_PEC(r)                  (uint32_t) (r >> 8)                                     /* I2C packet error checking register */

#define I2C_CCR_CCR(n)                  (uint32_t) (n & 0x0FFF)                                 /* I2C clock control register */
#define I2C_CCR_DUTY                    (uint32_t) (1 << 14)                                    /* I2C fast mode duty cycle */
#define I2C_CCR_FS                      (uint32_t) (1 << 15)                                    /* I2C master mode selection */

/* USART */
#define USART_SR_TC                     (uint32_t) (1 << 6)                                     /* USART Transmission Complete */
#define USART_SR_RXNE                   (uint32_t) (1 << 5)                                     /* USART Read data register not empty */

/* USART_CR1 */
#define USART_CR1_OVER8                 (uint32_t) (1 << 15)                                    /* Oversampling mode */
#define USART_CR1_UE                    (uint32_t) (1 << 13)                                    /* USART Enable */
#define USART_CR1_M9                    (uint32_t) (1 << 12)                                    /* World length 1: 9 bits, 0: 8bits */
#define USART_CR1_WAKE                  (uint32_t) (1 << 11)                                    /* Wakeup method */
#define USART_CR1_PCE                   (uint32_t) (1 << 10)                                    /* PCE Parity control enable */
#define USART_CR1_PS                    (uint32_t) (1 << 9)                                     /* Parity selection */
#define USART_CR1_PEIE                  (uint32_t) (1 << 8)                                     /* PE Interrupt enable */
#define USART_CR1_TXEIE                 (uint32_t) (1 << 7)                                     /* TXE interrupt enable */
#define USART_CR1_TCIE                  (uint32_t) (1 << 6)                                     /* Transmission complete interrupt enable */
#define USART_CR1_RXNEIE                (uint32_t) (1 << 5)                                     /* RXNE Interrupt Enable */
#define USART_CR1_IDLEIE                (uint32_t) (1 << 4)                                     /* IDEL INterrupt Enable */
#define USART_CR1_TE                    (uint32_t) (1 << 3)                                     /* USART Transmit Enable */
#define USART_CR1_RE                    (uint32_t) (1 << 2)                                     /* USART Receive Enable */
#define USART_CR1_RWU                   (uint32_t) (1 << 1)
#define USART_CR1_SBK                   (uint32_t) (1 << 0)                                     /* Send break characters */

#define USART_CR3_DMAR_EN               (uint32_t) (1 << 6)                                     /* USART DMA Receive Enable */
#define USART_CR3_DMAT_EN               (uint32_t) (1 << 7)                                     /* USART DMA Transmit Enable */

/* GPIO */
#define GPIOA                           (uint8_t)  (0)                                          /* GPIO Port A */
#define GPIOB                           (uint8_t)  (1)                                          /* GPIO Port B */
#define GPIOC                           (uint8_t)  (2)                                          /* GPIO Port C */
#define GPIOD                           (uint8_t)  (3)                                          /* GPIO Port D */
#define GPIOE                           (uint8_t)  (4)                                          /* GPIO Port E */
#define GPIOF                           (uint8_t)  (5)                                          /* GPIO Port F */
#define GPIOG                           (uint8_t)  (6)                                          /* GPIO Port G */
#define GPIOH                           (uint8_t)  (7)                                          /* GPIO Port H */
#define GPIOI                           (uint8_t)  (8)                                          /* GPIO Port I */

